# AnalysisDisplayVectorSettings Class

---
Contains vector settings for analysis display style element.
SystemObject Autodesk.Revit.DB.AnalysisAnalysisDisplayVectorSettings
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class AnalysisDisplayVectorSettings : IDisposable

    Public Class AnalysisDisplayVectorSettings
    	Implements IDisposable

    public ref class AnalysisDisplayVectorSettings : IDisposable

    type AnalysisDisplayVectorSettings =
        class
            interface IDisposable
        end
The AnalysisDisplayVectorSettings type exposes the following members.
| Name| Description
---|---|---
| AnalysisDisplayVectorSettings|  Constructs a default instance of vector settings.
| AnalysisDisplayVectorSettings(AnalysisDisplayVectorSettings)|  Constructs a new copy of the input AnalysisDisplayVectorSettings object.
Top
| Name| Description
---|---|---
| ArrowheadScale|  Type of arrow head scaling.
| ArrowLineWeight|  Line weight assigned to arrow lines for vectors.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Rounding|  Increment to which numeric values of analysis results are rounded in vectors.
| TextTypeId|  Element id of text associated with the settings.
| VectorOrientation|  Vector orientation.
| VectorPosition|  Vector position.
| VectorTextType|  Type of vector text visualization.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the AnalysisDisplayVectorSettings
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| IsEqual|  Compares two vector settings objects.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Analysis Namespace